app/views/pages/show.html.erb


<h4>Results For: <%= @company.financials.last.period.month %>-<%= @company.financials.last.period.year %></h4>
---
SELECT "financials".* FROM "financials" WHERE ("financials".company_id = 3) ORDER BY financials.id DESC LIMIT 1

			<th>Revenue</th>
			<td style='text-align:right'><%= number_to_currency(@company.financials.sum(:revenue), :precision => 0) %></td>
---
SELECT SUM("financials"."revenue") AS sum_id FROM "financials" WHERE ("financials".company_id = 3)

			<th>COGS</th>
			<td style='text-align:right'><%= number_to_currency(@company.financials.sum(:cogs), :precision => 0) %></td>
---
SELECT SUM("financials"."cogs") AS sum_id FROM "financials" WHERE ("financials".company_id = 3)

			<th>Current Assets</th>
			<td style='text-align:right'><%= number_to_currency(@company.financials.sum(:current_assets), :precision => 0) %></td>
---
SELECT SUM("financials"."current_assets") AS sum_id FROM "financials" WHERE ("financials".company_id = 3)

			<th>Other Assets</th>
			<td style='text-align:right'><%= number_to_currency(@company.financials.sum(:other_assets), :precision => 0) %></td>
---
SELECT SUM("financials"."other_assets") AS sum_id FROM "financials" WHERE ("financials".company_id = 3)