app/controllers/company_controller.rb

  def index
    @company = Company.all
---
SELECT "companies".* FROM "companies"

  def edit
    @company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1

  def destroy
    @company = Company.find(params[:id])
    @company.destroy
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1
DELETE FROM "companies" WHERE "companies"."id" = 1