app/controllers/companies_controller.rb

  def index
    @company = Company.all
---
SELECT "companies".* FROM "companies"

  def create
    @company = Company.new(params[:company])
    if @company.save
---
INSERT INTO "companies" ("name", "founded", "address", "phone", "ceo", "cfo", "president", "website", "headcount", "created_at", "updated_at") VALUES ('CradlePoint', NULL, NULL, NULL, 'Pat Sewall', NULL, NULL, NULL, NULL, '2011-04-30 21:50:49.123405', '2011-04-30 21:50:49.123405')

  def edit
    @company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1

  def update
    @company = Company.find(params[:id])
    if @company.update_attributes(params[:company])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 2 LIMIT 1
UPDATE "companies" SET "ceo" = 'Pat Sewalls', "updated_at" = '2011-04-30 21:51:42.252948' WHERE "companies"."id" = 2

  def destroy
    @company = Company.find(params[:id])
    @company.destroy
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1
DELETE FROM "companies" WHERE "companies"."id" = 1