app/controllers/financials_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 2 LIMIT 1
---
  def new
    # @company = Company.find(params[:company_id])
    # @financial = @company.financials.build
    @company = Company.find(params[:company_id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 2 LIMIT 1
INSERT INTO "financials" ("revenue", "cogs", "sga", "other_expense", "other_income", "interest_income", "interest_expense", "current_assets", "other_assets", "current_liabilties", "other_liabilities", "common_stock", "retained_earnings", "cash_in_ops", "cash_out_ops", "cash_investing", "cash_financing", "income_commentary", "balance_commentary", "period", "company_id", "created_at", "updated_at") VALUES (10000, 5000, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'Rough month, we''d really like to have it back to be completely frank.', NULL, '2011-04-01', NULL, '2011-04-30 22:59:27.901763', '2011-04-30 22:59:27.901763')
---
  def create
    @company = Company.find(params[:company_id])
    @financial = @company.financials.new(params[:financial])

    if @financial.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 3 LIMIT 1
SELECT "financials".* FROM "financials" WHERE "financials"."id" = 2 LIMIT 1
---
  def show
    @company = Company.find(params[:company_id])
    @financial = Financial.find(params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 3 LIMIT 1
SELECT "financials".* FROM "financials" WHERE "financials"."id" = 14 AND ("financials".company_id = 3) LIMIT 1
---
  def edit
    @company = Company.find(params[:company_id])
    @financial = @company.financials.find(params[:id])

SELECT "financials".* FROM "financials" WHERE "financials"."id" = 14 LIMIT 1
UPDATE "financials" SET "income_commentary" = 'A decent month. Change!', "updated_at" = '2011-05-01 04:06:17.313572' WHERE "financials"."id" = 14
---
  def update
    @financial = Financial.find(params[:id])
    if @financial.update_attributes(params[:financial])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 2 LIMIT 1
SELECT "financials".* FROM "financials" WHERE ("financials".company_id = 2)
---
  def index
    @company = Company.find(params[:company_id])
    @financial = @company.financials.all