app/controllers/pages_controller.rb

  def index
    @company = Company.all
---
SELECT "companies".* FROM "companies"